# Module 1 - Manipulating data with Pandas
## Pandas Part 2

![austin](http://www.austintexas.gov/sites/default/files/aac_logo.jpg)

## Scenario:
You have decided that you want to start your own animal shelter, but you want to get an idea of what that will entail and get more information about planning. In this lecture, we are continue to look at a real data set collected by Austin Animal Center over several years and use our pandas skills from the last lecture and learn some new ones in order to explore this data further.

#### _Our goals today are to be able to_: <br/>

Use the pandas library to:

- Get summary info about a dataset and its variables
  - Apply and use info, describe and dtypes
  - Use mean, min, max, and value_counts 
- Use apply and applymap to transform columns and create new values

- Explain lambda functions and use them to use an apply on a DataFrame
- Explain what a groupby object is and split a DataFrame using a groupby
- Reshape a DataFrame using joins, merges, pivoting, stacking, and melting

## Getting started

Let's take a moment to examine the [Austin Animal Center data set](https://data.austintexas.gov/Health-and-Community-Services/Austin-Animal-Center-Outcomes/9t4d-g238/data). What kinds of questions can we ask this data and what kinds of information can we get back?

In pairs and as a class, let's generate ideas.

## Switch gears

Before we answer those questions about the animal shelter data, let's practice on a simpler dataset.
Read about this dataset here: https://www.kaggle.com/ronitf/heart-disease-uci
![heart-data](images/heartbloodpres.jpeg)

The dataset is most often used to practice classification algorithms. Can one develop a model to predict the likelihood of heart disease based on other measurable characteristics? We will return to that specific question in a few weeks, but for now we wish to use the dataset to practice some pandas methods.

### 1. Get summary info about a dataset and its variables

Applying and using `info`, `describe`, `mean`, `min`, `max`, `apply`, and `applymap` from the Pandas library

The Pandas library has several useful tools built in. Let's explore some of them.

In [1]:
!pwd
!ls -al data

/Users/alexandercheng/Desktop/code/dc-ds-111819/module-1/day-6-pandas-3
total 40
drwxr-xr-x  5 alexandercheng  staff    160 Nov 25 09:33 .
drwxr-xr-x  5 alexandercheng  staff    160 Nov 25 09:34 ..
-rw-r--r--@ 1 alexandercheng  staff     95 Nov 25 09:33 ds_chars.csv
-rwxr-xr-x@ 1 alexandercheng  staff  11328 Nov 25 09:33 heart.csv
-rw-r--r--@ 1 alexandercheng  staff    130 Nov 25 09:33 states.csv

In [39]:
import numpy as np
import matplotlib as plt
%matplotlib inline
import pandas as pd
uci = pd.read_csv('data/heart.csv')

In [3]:
uci.head()

,age,sex,cp,trestbps,chol,fbs,restecg,thalach,exang,oldpeak,slope,ca,thal,target
0,63,1,3,145,233,1,0,150,0,2.3,0,0,1,1
1,37,1,2,130,250,0,1,187,0,3.5,0,0,2,1
2,41,0,1,130,204,0,0,172,0,1.4,2,0,2,1
3,56,1,1,120,236,0,1,178,0,0.8,2,0,2,1
4,57,0,0,120,354,0,1,163,1,0.6,2,0,2,1

#### The `.columns` and `.shape` Attributes

In [4]:
uci.columns

Index(['age', 'sex', 'cp', 'trestbps', 'chol', 'fbs', 'restecg', 'thalach',
       'exang', 'oldpeak', 'slope', 'ca', 'thal', 'target'],
      dtype='object')

In [5]:
uci.shape

(303, 14)

#### The `.info() `and `.describe()` and `.dtypes` methods

Pandas DataFrames have many useful methods! Let's look at `.info()` , `.describe()`, and `dtypes`.

In [6]:
# Call the .info() method on our dataset. What do you observe?

uci.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 303 entries, 0 to 302
Data columns (total 14 columns):
age         303 non-null int64
sex         303 non-null int64
cp          303 non-null int64
trestbps    303 non-null int64
chol        303 non-null int64
fbs         303 non-null int64
restecg     303 non-null int64
thalach     303 non-null int64
exang       303 non-null int64
oldpeak     303 non-null float64
slope       303 non-null int64
ca          303 non-null int64
thal        303 non-null int64
target      303 non-null int64
dtypes: float64(1), int64(13)
memory usage: 33.3 KB

In [7]:
# Call the .describe() method on our dataset. What do you observe?

uci.describe()

,age,sex,cp,trestbps,chol,fbs,restecg,thalach,exang,oldpeak,slope,ca,thal,target
count,303.000000,303.000000,303.000000,303.000000,303.000000,303.000000,303.000000,303.000000,303.000000,303.000000,303.000000,303.000000,303.000000,303.000000
mean,54.366337,0.683168,0.966997,131.623762,246.264026,0.148515,0.528053,149.646865,0.326733,1.039604,1.399340,0.729373,2.313531,0.544554
std,9.082101,0.466011,1.032052,17.538143,51.830751,0.356198,0.525860,22.905161,0.469794,1.161075,0.616226,1.022606,0.612277,0.498835
min,29.000000,0.000000,0.000000,94.000000,126.000000,0.000000,0.000000,71.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000
25%,47.500000,0.000000,0.000000,120.000000,211.000000,0.000000,0.000000,133.500000,0.000000,0.000000,1.000000,0.000000,2.000000,0.000000
50%,55.000000,1.000000,1.000000,130.000000,240.000000,0.000000,1.000000,153.000000,0.000000,0.800000,1.000000,0.000000,2.000000,1.000000
75%,61.000000,1.000000,2.000000,140.000000,274.500000,0.000000,1.000000,166.000000,1.000000,1.600000,2.000000,1.000000,3.000000,1.000000
max,77.000000,1.000000,3.000000,200.000000,564.000000,1.000000,2.000000,202.000000,1.000000,6.200000,2.000000,4.000000,3.000000,1.000000

In [8]:
# Use the code below. How does the output differ from info() ?
uci.dtypes

age           int64
sex           int64
cp            int64
trestbps      int64
chol          int64
fbs           int64
restecg       int64
thalach       int64
exang         int64
oldpeak     float64
slope         int64
ca            int64
thal          int64
target        int64
dtype: object

In [9]:
type(uci.ca)

pandas.core.series.Series

#### `.mean()`, .`min()`,` .max()`, `.sum()`

The methods `.mean()`, `.min()`, and `.max()` will perform just the way you think they will!

Note that these are methods both for Series and for DataFrames.

In [10]:
uci.ca.mean()
#this is the mean of the Pandas Series "ca"

0.7293729372937293

#### The Axis Variable

In [17]:
uci.median(axis=0) # Try [shift] + [tab] here!
#axis=0 adds up values in a column. (adding vertical across a column)
#axis=1 adds up values in a row. (adding horizontally across the dataframe)

age          55.0
sex           1.0
cp            1.0
trestbps    130.0
chol        240.0
fbs           0.0
restecg       1.0
thalach     153.0
exang         0.0
oldpeak       0.8
slope         1.0
ca            0.0
thal          2.0
target        1.0
dtype: float64

#### .`value_counts()`

For a DataFrame _Series_, the `.value_counts()` method will tell you how many of each value you've got.

In [26]:
uci.columns = [x.lower() for x in uci.columns]

In [27]:
uci['age'].value_counts()[:10]

58    19
57    17
54    16
59    14
52    13
51    12
62    11
44    11
60    11
56    11
Name: age, dtype: int64

In [28]:
uci.head()

,age,sex,cp,trestbps,chol,fbs,restecg,thalach,exang,oldpeak,slope,ca,thal,target
0,63,1,3,145,233,1,0,150,0,2.3,0,0,1,1
1,37,1,2,130,250,0,1,187,0,3.5,0,0,2,1
2,41,0,1,130,204,0,0,172,0,1.4,2,0,2,1
3,56,1,1,120,236,0,1,178,0,0.8,2,0,2,1
4,57,0,0,120,354,0,1,163,1,0.6,2,0,2,1

Exercise: What are the different values for restecg?

In [30]:
# Your code here!
uci.restecg.unique()
uci

,age,sex,cp,trestbps,chol,fbs,restecg,thalach,exang,oldpeak,slope,ca,thal,target
0,63,1,3,145,233,1,0,150,0,2.3,0,0,1,1
1,37,1,2,130,250,0,1,187,0,3.5,0,0,2,1
2,41,0,1,130,204,0,0,172,0,1.4,2,0,2,1
3,56,1,1,120,236,0,1,178,0,0.8,2,0,2,1
4,57,0,0,120,354,0,1,163,1,0.6,2,0,2,1
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
298,57,0,0,140,241,0,1,123,1,0.2,1,0,3,0
299,45,1,3,110,264,0,1,132,0,1.2,1,0,3,0
300,68,1,0,144,193,1,1,141,0,3.4,1,2,3,0
301,57,1,0,130,131,0,1,115,1,1.2,1,1,3,0
302,57,0,1,130,236,0,0,174,0,0.0,1,1,2,0

### Apply to Animal Shelter Data
Using `.info()` and `.describe()` and `dtypes` what observations can we make about the data?

What are the breed value counts?

How about age counts for dogs?

In [58]:
animal_outcomes = pd.read_csv('https://data.austintexas.gov/api/views/9t4d-g238/rows.csv?accessType=DOWNLOAD')

In [59]:
animal_outcomes.columns = [x.lower().replace(' ', '') for x in animal_outcomes.columns]
animal_outcomes

,animalid,name,datetime,monthyear,dateofbirth,outcometype,outcomesubtype,animaltype,sexuponoutcome,ageuponoutcome,breed,color
0,A789027,Lennie,02/17/2019 11:44:00 AM,02/17/2019 11:44:00 AM,02/13/2017,Adoption,NaN,Dog,Neutered Male,2 years,Chihuahua Shorthair Mix,Cream
1,A720371,Moose,02/13/2016 05:59:00 PM,02/13/2016 05:59:00 PM,10/08/2015,Adoption,NaN,Dog,Neutered Male,4 months,Anatol Shepherd/Labrador Retriever,Buff
2,A674754,NaN,03/18/2014 11:47:00 AM,03/18/2014 11:47:00 AM,03/12/2014,Transfer,Partner,Cat,Intact Male,6 days,Domestic Shorthair Mix,Orange Tabby
3,A689724,*Donatello,10/18/2014 06:52:00 PM,10/18/2014 06:52:00 PM,08/01/2014,Adoption,NaN,Cat,Neutered Male,2 months,Domestic Shorthair Mix,Black
4,A680969,*Zeus,08/05/2014 04:59:00 PM,08/05/2014 04:59:00 PM,06/03/2014,Adoption,NaN,Cat,Neutered Male,2 months,Domestic Shorthair Mix,White/Orange Tabby
...,...,...,...,...,...,...,...,...,...,...,...,...
111739,A760365,NaN,10/18/2017 01:27:00 PM,10/18/2017 01:27:00 PM,10/17/2016,Transfer,Partner,Cat,Intact Female,1 year,Domestic Shorthair Mix,Silver Tabby
111740,A767465,Loco,03/01/2018 06:28:00 PM,03/01/2018 06:28:00 PM,03/01/2014,Return to Owner,NaN,Dog,Neutered Male,4 years,Chihuahua Shorthair Mix,Black/Cream
111741,A774386,NaN,06/23/2018 11:59:00 AM,06/23/2018 11:59:00 AM,04/07/2018,Adoption,NaN,Cat,Neutered Male,2 months,Domestic Shorthair Mix,Brown Tabby
111742,A772554,Muneca,05/21/2018 12:59:00 PM,05/21/2018 12:59:00 PM,11/01/2012,Return to Owner,NaN,Dog,Spayed Female,5 years,Norfolk Terrier Mix,Tan
111743,A767854,NaN,03/12/2018 01:27:00 PM,03/12/2018 01:27:00 PM,07/08/2017,Transfer,Partner,Cat,Intact Male,8 months,Domestic Shorthair Mix,Orange Tabby/White

In [60]:
animal_outcomes.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 111744 entries, 0 to 111743
Data columns (total 12 columns):
animalid          111744 non-null object
name              76505 non-null object
datetime          111744 non-null object
monthyear         111744 non-null object
dateofbirth       111744 non-null object
outcometype       111736 non-null object
outcomesubtype    50868 non-null object
animaltype        111744 non-null object
sexuponoutcome    111740 non-null object
ageuponoutcome    111720 non-null object
breed             111744 non-null object
color             111744 non-null object
dtypes: object(12)
memory usage: 10.2+ MB

In [61]:
animal_outcomes.describe()

,animalid,name,datetime,monthyear,dateofbirth,outcometype,outcomesubtype,animaltype,sexuponoutcome,ageuponoutcome,breed,color
count,111744,76505,111744,111744,111744,111736,50868,111744,111740,111720,111744,111744
unique,100110,18197,91885,91885,6656,9,22,5,5,50,2504,580
top,A721033,Max,04/18/2016 12:00:00 AM,04/18/2016 12:00:00 AM,09/01/2015,Adoption,Partner,Dog,Neutered Male,1 year,Domestic Shorthair Mix,Black/White
freq,33,498,39,39,118,48777,28010,63222,39112,20161,30466,11695

In [62]:
animal_outcomes.dtypes

animalid          object
name              object
datetime          object
monthyear         object
dateofbirth       object
outcometype       object
outcomesubtype    object
animaltype        object
sexuponoutcome    object
ageuponoutcome    object
breed             object
color             object
dtype: object

In [65]:
animal_outcomes.breed.value_counts()

Domestic Shorthair Mix                         30466
Pit Bull Mix                                    8136
Labrador Retriever Mix                          6419
Chihuahua Shorthair Mix                         6064
Domestic Shorthair                              3975
                                               ...
Domestic Longhair/Domestic Longhair                1
Airedale Terrier/Irish Terrier                     1
English Springer Spaniel/Labrador Retriever        1
Norwich Terrier/Chihuahua Longhair                 1
West Highland/Lhasa Apso                           1
Name: breed, Length: 2504, dtype: int64

In [69]:
animal_outcomes.loc[animal_outcomes.animaltype == 'Dog'].ageuponoutcome.value_counts()

1 year       12337
2 years      11504
3 years       5164
2 months      4901
4 years       3212
5 years       2931
6 years       1973
1 month       1961
7 years       1664
8 years       1587
4 months      1530
5 months      1484
3 months      1482
6 months      1399
10 months     1259
8 months      1251
10 years      1197
7 months       929
9 years        913
9 months       822
12 years       580
11 months      548
11 years       499
13 years       356
14 years       239
4 weeks        228
15 years       187
2 weeks        177
1 weeks        169
3 weeks        127
16 years        90
2 days          88
1 week          81
1 day           64
0 years         55
17 years        39
6 days          37
5 days          32
3 days          30
5 weeks         27
18 years        22
4 days          19
19 years        14
-1 years         4
20 years         3
24 years         1
-3 years         1
Name: ageuponoutcome, dtype: int64

In [70]:
animal_outcomes.loc[animal_outcomes.ageuponoutcome == '-3 years']

,animalid,name,datetime,monthyear,dateofbirth,outcometype,outcomesubtype,animaltype,sexuponoutcome,ageuponoutcome,breed,color
40045,A687107,Montopolis,02/25/2016 06:04:00 PM,02/25/2016 06:04:00 PM,03/17/2019,Return to Owner,NaN,Dog,Neutered Male,-3 years,Rhod Ridgeback,Red/Brown

What are the breed `value_counts`?
What's the top breed for adopted dogs?

How about outcome counts for dogs?

In [71]:
animal_outcomes.breed.value_counts()

Domestic Shorthair Mix                         30466
Pit Bull Mix                                    8136
Labrador Retriever Mix                          6419
Chihuahua Shorthair Mix                         6064
Domestic Shorthair                              3975
                                               ...
Domestic Longhair/Domestic Longhair                1
Airedale Terrier/Irish Terrier                     1
English Springer Spaniel/Labrador Retriever        1
Norwich Terrier/Chihuahua Longhair                 1
West Highland/Lhasa Apso                           1
Name: breed, Length: 2504, dtype: int64

In [73]:
animal_outcomes.loc[(animal_outcomes.animaltype == 'Dog') &
                    (animal_outcomes.outcometype == 'Adoption')].breed.value_counts()

#is animaltype series == "Dog", is it true or false.
#is outcometype series == "Adoption", is it true or false.

Labrador Retriever Mix                        3268
Pit Bull Mix                                  3160
Chihuahua Shorthair Mix                       2905
German Shepherd Mix                           1413
Australian Cattle Dog Mix                      797
                                              ...
Silky Terrier/Yorkshire Terrier                  1
Chesa Bay Retr/Pit Bull                          1
Miniature Poodle/Bichon Frise                    1
Rat Terrier/Pembroke Welsh Corgi                 1
Soft Coated Wheaten Terrier/Border Terrier       1
Name: breed, Length: 1630, dtype: int64

### 2.  Changing data

#### DataFrame.applymap() and Series.map()

The ```.applymap()``` method takes a function as input that it will then apply to every entry in the dataframe.

In [74]:
def successor(x):
    return x + 1

In [75]:
uci.applymap(successor).head()

,age,sex,cp,trestbps,chol,fbs,restecg,thalach,exang,oldpeak,slope,ca,thal,target
0,64,2,4,146,234,2,1,151,1,3.3,1,1,2,2
1,38,2,3,131,251,1,2,188,1,4.5,1,1,3,2
2,42,1,2,131,205,1,1,173,1,2.4,3,1,3,2
3,57,2,2,121,237,1,2,179,1,1.8,3,1,3,2
4,58,1,1,121,355,1,2,164,2,1.6,3,1,3,2

The `.map()` method takes a function as input that it will then apply to every entry in the Series.

In [76]:
uci['age'].map(successor).tail(10)

293    68
294    45
295    64
296    64
297    60
298    58
299    46
300    69
301    58
302    58
Name: age, dtype: int64

In [78]:
uci.iloc[:, 0:2]

     age  sex
0     63    1
1     37    1
2     41    0
3     56    1
4     57    0
..   ...  ...
298   57    0
299   45    1
300   68    1
301   57    1
302   57    0

[303 rows x 2 columns]

#### Anonymous Functions (Lambda Abstraction)

Simple functions can be defined right in the function call. This is called 'lambda abstraction'; the function thus defined has no name and hence is "anonymous".

In [79]:
uci['oldpeak'].map(lambda x: round(x))[:4]

0    2
1    4
2    1
3    1
Name: oldpeak, dtype: int64

Exercise: Use an anonymous function to turn the entries in age to strings

In [87]:
uci.age.apply(lambda x: str(x))[:10]
uci.age.apply(str)[:10]
uci.age.astype(str)[:10]

0    63
1    37
2    41
3    56
4    57
5    57
6    56
7    44
8    52
9    57
Name: age, dtype: object

### Apply to Animal Shelter Data

Use an `apply` to change the dates from strings to datetime objects. Similarly, use an apply to change the ages of the animals from strings to floats.

In [ ]:
# Your code here

In [81]:
animal_outcomes.head(2)

,animalid,name,datetime,monthyear,dateofbirth,outcometype,outcomesubtype,animaltype,sexuponoutcome,ageuponoutcome,breed,color
0,A789027,Lennie,02/17/2019 11:44:00 AM,02/17/2019 11:44:00 AM,02/13/2017,Adoption,NaN,Dog,Neutered Male,2 years,Chihuahua Shorthair Mix,Cream
1,A720371,Moose,02/13/2016 05:59:00 PM,02/13/2016 05:59:00 PM,10/08/2015,Adoption,NaN,Dog,Neutered Male,4 months,Anatol Shepherd/Labrador Retriever,Buff

In [96]:
pd.to_datetime(animal_outcomes['datetime'])

0        2019-02-17 11:44:00
1        2016-02-13 17:59:00
2        2014-03-18 11:47:00
3        2014-10-18 18:52:00
4        2014-08-05 16:59:00
                 ...
111739   2017-10-18 13:27:00
111740   2018-03-01 18:28:00
111741   2018-06-23 11:59:00
111742   2018-05-21 12:59:00
111743   2018-03-12 13:27:00
Name: datetime, Length: 111744, dtype: datetime64[ns]

In [97]:
pd.to_datetime(animal_outcomes['monthyear'])

0        2019-02-17 11:44:00
1        2016-02-13 17:59:00
2        2014-03-18 11:47:00
3        2014-10-18 18:52:00
4        2014-08-05 16:59:00
                 ...
111739   2017-10-18 13:27:00
111740   2018-03-01 18:28:00
111741   2018-06-23 11:59:00
111742   2018-05-21 12:59:00
111743   2018-03-12 13:27:00
Name: monthyear, Length: 111744, dtype: datetime64[ns]

In [98]:
pd.to_datetime(animal_outcomes['dateofbirth'])

0        2017-02-13
1        2015-10-08
2        2014-03-12
3        2014-08-01
4        2014-06-03
            ...
111739   2016-10-17
111740   2014-03-01
111741   2018-04-07
111742   2012-11-01
111743   2017-07-08
Name: dateofbirth, Length: 111744, dtype: datetime64[ns]

In [102]:
animal_outcomes.iloc[:, :5].head(5)

,animalid,name,datetime,monthyear,dateofbirth
0,A789027,Lennie,02/17/2019 11:44:00 AM,02/17/2019 11:44:00 AM,02/13/2017
1,A720371,Moose,02/13/2016 05:59:00 PM,02/13/2016 05:59:00 PM,10/08/2015
2,A674754,NaN,03/18/2014 11:47:00 AM,03/18/2014 11:47:00 AM,03/12/2014
3,A689724,*Donatello,10/18/2014 06:52:00 PM,10/18/2014 06:52:00 PM,08/01/2014
4,A680969,*Zeus,08/05/2014 04:59:00 PM,08/05/2014 04:59:00 PM,06/03/2014

## 3. Methods for Re-Organizing DataFrames
#### `.groupby()`

Those of you familiar with SQL have probably used the GROUP BY command. Pandas has this, too.

The `.groupby()` method is especially useful for aggregate functions applied to the data grouped in particular ways.

In [ ]:
uci.groupby('sex')

#### `.groups` and `.get_group()`

In [ ]:
uci.groupby('sex').groups

In [ ]:
uci.groupby('sex').get_group(0) # .tail()

### Aggregating

In [ ]:
uci.groupby('sex').std()

Exercise: Tell me the average cholesterol level for those with heart disease.

In [ ]:
# Your code here!

### Apply to Animal Shelter Data

#### Task 1
- Use a groupby to show the average age of the different kinds of animal types.
- What about by animal types **and** gender?

#### Task 2:
- Create new columns `year` and `month` by using a lambda function x.year on date
- Use `groupby` and `.size()` to tell me how many animals are adopted by month

In [ ]:
# Your code here

## 4. Reshaping a DataFrame

### `.pivot()`

Those of you familiar with Excel have probably used Pivot Tables. Pandas has a similar functionality.

In [ ]:
uci.pivot(values='sex', columns='target').head()

### Methods for Combining DataFrames: `.join()`, `.merge()`, `.concat()`, `.melt()`

### `.join()`

In [ ]:
toy1 = pd.DataFrame([[63, 142], [33, 47]], columns=['age', 'HP'])
toy2 = pd.DataFrame([[63, 100], [33, 200]], columns=['age', 'HP'])

In [ ]:
toy1.join(toy2.set_index('age'),
          on='age',
          lsuffix='_A',
          rsuffix='_B').head()

### `.merge()`

In [ ]:
ds_chars = pd.read_csv('data/ds_chars.csv', index_col=0)

In [ ]:
states = pd.read_csv('data/states.csv', index_col=0)

In [ ]:
ds_chars.merge(states,
               left_on='home_state',
               right_on='state',
               how='inner')

### `pd.concat()`

Exercise: Look up the documentation on pd.concat (https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.concat.html) and use it to concatenate ds_chars and states.
<br/>
Your result should still have only five rows!

In [ ]:
pd.concat([ds_chars, states])

### `pd.melt()`

Melting removes the structure from your DataFrame and puts the data in a 'variable' and 'value' format.

In [ ]:
ds_chars.head()

In [ ]:
pd.melt(ds_chars,
        id_vars=['name'],
        value_vars=['HP', 'home_state'])

## Bringing it all together with the Animal Shelter Data

Join the data from the [Austin Animal Shelter Intake dataset](https://data.austintexas.gov/Health-and-Community-Services/Austin-Animal-Center-Intakes/wter-evkm) to the outcomes dataset by Animal ID.

Use the dates from each dataset to see how long animals spend in the shelter. Does it differ by time of year? By outcome?

The Url for the Intake Dataset is here: https://data.austintexas.gov/api/views/wter-evkm/rows.csv?accessType=DOWNLOAD

_Hints_ :
- import and clean the intake dataset first
- use apply/applymap/lambda to change the variables to their proper format in the intake data
- rename the columns in the intake dataset *before* joining
- create a new days-in-shelter variable
- Notice that some values in "days_in_shelter" column are NaN or values < 0 (remove these rows using the "<" operator and ~is.na())
- Use group_by to get some interesting information about the dataset

Make sure to export and save your cleaned dataset. We will use it in a later lecture!

use the notation `df.to_csv()` to write the `df` to a csv. Read more about the `to_csv()` documentation [here](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.to_csv.html)

In [ ]:
#code here